Week9/C_mixerSimInter/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ".*"
    {
        type           fixedValue;
        value          $internalField;
    }

    top
    {
        type            zeroGradient;
    }

    mixer
    {
        type            movingWallVelocity;
        value           $internalField;
    }

    "AMI.*"
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //
